; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-34)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 ball33 ball34 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(ball ball32)
(ball ball33)
(ball ball34)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
(at ball14 rooma)
(at ball15 rooma)
(at ball16 rooma)
(at ball17 rooma)
(at ball18 rooma)
(at ball19 rooma)
(at ball20 rooma)
(at ball21 rooma)
(at ball22 rooma)
(at ball23 rooma)
(at ball24 rooma)
(at ball25 rooma)
(at ball26 rooma)
(at ball27 rooma)
(at ball28 rooma)
(at ball29 rooma)
(at ball30 rooma)
(at ball31 rooma)
(at ball32 rooma)
(at ball33 rooma)
(at ball34 rooma)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 room3)
(at ball16 room3)
(at ball17 room3)
(at ball18 room3)
(at ball19 room4)
(at ball20 room4)
(at ball21 room4)
(at ball22 room4)
(at ball23 room4)
(at ball24 room4)
(at ball25 room5)
(at ball26 room5)
(at ball27 room5)
(at ball28 room5)
(at ball29 room5)
(at ball30 room5)
(at ball31 room5)
(at ball32 room5)
(at ball33 room5)
(at ball34 room5)
)
)
)

; plan
1. (pick ball9 rooma left)
   deleted: (at ball9 rooma) (free left)
   added: (carry ball9 left)
   goals met: 5 of 34
2. (pick ball8 rooma right)
   deleted: (at ball8 rooma) (free right)
   added: (carry ball8 right)
   goals met: 5 of 34
3. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 5 of 34
4. (drop ball8 roomb right)
   deleted: (carry ball8 right)
   added: (at ball8 roomb) (free right)
   goals met: 6 of 34
5. (drop ball9 roomb left)
   deleted: (carry ball9 left)
   added: (at ball9 roomb) (free left)
   goals met: 7 of 34
6. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 7 of 34
7. (pick ball7 rooma left)
   deleted: (at ball7 rooma) (free left)
   added: (carry ball7 left)
   goals met: 7 of 34
8. (pick ball6 rooma right)
   deleted: (at ball6 rooma) (free right)
   added: (carry ball6 right)
   goals met: 7 of 34
9. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 7 of 34
10. (drop ball6 roomb right)
   deleted: (carry ball6 right)
   added: (at ball6 roomb) (free right)
   goals met: 8 of 34
11. (drop ball7 roomb left)
   deleted: (carry ball7 left)
   added: (at ball7 roomb) (free left)
   goals met: 9 of 34
12. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 9 of 34
13. (pick ball34 rooma left)
   deleted: (at ball34 rooma) (free left)
   added: (carry ball34 left)
   goals met: 9 of 34
14. (pick ball33 rooma right)
   deleted: (at ball33 rooma) (free right)
   added: (carry ball33 right)
   goals met: 9 of 34
15. (move rooma room5)
   deleted: (at-robby rooma)
   added: (at-robby room5)
   goals met: 9 of 34
16. (drop ball33 room5 right)
   deleted: (carry ball33 right)
   added: (at ball33 room5) (free right)
   goals met: 10 of 34
17. (drop ball34 room5 left)
   deleted: (carry ball34 left)
   added: (at ball34 room5) (free left)
   goals met: 11 of 34
18. (move room5 rooma)
   deleted: (at-robby room5)
   added: (at-robby rooma)
   goals met: 11 of 34
19. (pick ball32 rooma left)
   deleted: (at ball32 rooma) (free left)
   added: (carry ball32 left)
   goals met: 11 of 34
20. (pick ball31 rooma right)
   deleted: (at ball31 rooma) (free right)
   added: (carry ball31 right)
   goals met: 11 of 34
21. (move rooma room5)
   deleted: (at-robby rooma)
   added: (at-robby room5)
   goals met: 11 of 34
22. (drop ball31 room5 right)
   deleted: (carry ball31 right)
   added: (at ball31 room5) (free right)
   goals met: 12 of 34
23. (drop ball32 room5 left)
   deleted: (carry ball32 left)
   added: (at ball32 room5) (free left)
   goals met: 13 of 34
24. (move room5 rooma)
   deleted: (at-robby room5)
   added: (at-robby rooma)
   goals met: 13 of 34
25. (pick ball30 rooma left)
   deleted: (at ball30 rooma) (free left)
   added: (carry ball30 left)
   goals met: 13 of 34
26. (pick ball29 rooma right)
   deleted: (at ball29 rooma) (free right)
   added: (carry ball29 right)
   goals met: 13 of 34
27. (move rooma room5)
   deleted: (at-robby rooma)
   added: (at-robby room5)
   goals met: 13 of 34
28. (drop ball29 room5 right)
   deleted: (carry ball29 right)
   added: (at ball29 room5) (free right)
   goals met: 14 of 34
29. (drop ball30 room5 left)
   deleted: (carry ball30 left)
   added: (at ball30 room5) (free left)
   goals met: 15 of 34
30. (move room5 rooma)
   deleted: (at-robby room5)
   added: (at-robby rooma)
   goals met: 15 of 34
31. (pick ball28 rooma left)
   deleted: (at ball28 rooma) (free left)
   added: (carry ball28 left)
   goals met: 15 of 34
32. (pick ball27 rooma right)
   deleted: (at ball27 rooma) (free right)
   added: (carry ball27 right)
   goals met: 15 of 34
33. (move rooma room5)
   deleted: (at-robby rooma)
   added: (at-robby room5)
   goals met: 15 of 34
34. (drop ball27 room5 right)
   deleted: (carry ball27 right)
   added: (at ball27 room5) (free right)
   goals met: 16 of 34
35. (drop ball28 room5 left)
   deleted: (carry ball28 left)
   added: (at ball28 room5) (free left)
   goals met: 17 of 34
36. (move room5 rooma)
   deleted: (at-robby room5)
   added: (at-robby rooma)
   goals met: 17 of 34
37. (pick ball26 rooma left)
   deleted: (at ball26 rooma) (free left)
   added: (carry ball26 left)
   goals met: 17 of 34
38. (pick ball25 rooma right)
   deleted: (at ball25 rooma) (free right)
   added: (carry ball25 right)
   goals met: 17 of 34
39. (move rooma room5)
   deleted: (at-robby rooma)
   added: (at-robby room5)
   goals met: 17 of 34
40. (drop ball25 room5 right)
   deleted: (carry ball25 right)
   added: (at ball25 room5) (free right)
   goals met: 18 of 34
41. (drop ball26 room5 left)
   deleted: (carry ball26 left)
   added: (at ball26 room5) (free left)
   goals met: 19 of 34
42. (move room5 roomb)
   deleted: (at-robby room5)
   added: (at-robby roomb)
   goals met: 19 of 34
43. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 19 of 34
44. (pick ball24 rooma left)
   deleted: (at ball24 rooma) (free left)
   added: (carry ball24 left)
   goals met: 19 of 34
45. (pick ball23 rooma right)
   deleted: (at ball23 rooma) (free right)
   added: (carry ball23 right)
   goals met: 19 of 34
46. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 19 of 34
47. (drop ball23 room4 right)
   deleted: (carry ball23 right)
   added: (at ball23 room4) (free right)
   goals met: 20 of 34
48. (drop ball24 room4 left)
   deleted: (carry ball24 left)
   added: (at ball24 room4) (free left)
   goals met: 21 of 34
49. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 21 of 34
50. (pick ball22 rooma left)
   deleted: (at ball22 rooma) (free left)
   added: (carry ball22 left)
   goals met: 21 of 34
51. (pick ball21 rooma right)
   deleted: (at ball21 rooma) (free right)
   added: (carry ball21 right)
   goals met: 21 of 34
52. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 21 of 34
53. (drop ball21 room4 right)
   deleted: (carry ball21 right)
   added: (at ball21 room4) (free right)
   goals met: 22 of 34
54. (drop ball22 room4 left)
   deleted: (carry ball22 left)
   added: (at ball22 room4) (free left)
   goals met: 23 of 34
55. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 23 of 34
56. (pick ball20 rooma left)
   deleted: (at ball20 rooma) (free left)
   added: (carry ball20 left)
   goals met: 23 of 34
57. (pick ball19 rooma right)
   deleted: (at ball19 rooma) (free right)
   added: (carry ball19 right)
   goals met: 23 of 34
58. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 23 of 34
59. (drop ball19 room4 right)
   deleted: (carry ball19 right)
   added: (at ball19 room4) (free right)
   goals met: 24 of 34
60. (drop ball20 room4 left)
   deleted: (carry ball20 left)
   added: (at ball20 room4) (free left)
   goals met: 25 of 34
61. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 25 of 34
62. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 25 of 34
63. (pick ball18 rooma left)
   deleted: (at ball18 rooma) (free left)
   added: (carry ball18 left)
   goals met: 25 of 34
64. (pick ball17 rooma right)
   deleted: (at ball17 rooma) (free right)
   added: (carry ball17 right)
   goals met: 25 of 34
65. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 25 of 34
66. (drop ball17 room3 right)
   deleted: (carry ball17 right)
   added: (at ball17 room3) (free right)
   goals met: 26 of 34
67. (drop ball18 room3 left)
   deleted: (carry ball18 left)
   added: (at ball18 room3) (free left)
   goals met: 27 of 34
68. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 27 of 34
69. (pick ball16 rooma left)
   deleted: (at ball16 rooma) (free left)
   added: (carry ball16 left)
   goals met: 27 of 34
70. (pick ball15 rooma right)
   deleted: (at ball15 rooma) (free right)
   added: (carry ball15 right)
   goals met: 27 of 34
71. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 27 of 34
72. (drop ball15 room3 right)
   deleted: (carry ball15 right)
   added: (at ball15 room3) (free right)
   goals met: 28 of 34
73. (drop ball16 room3 left)
   deleted: (carry ball16 left)
   added: (at ball16 room3) (free left)
   goals met: 29 of 34
74. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 29 of 34
75. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 29 of 34
76. (pick ball14 rooma left)
   deleted: (at ball14 rooma) (free left)
   added: (carry ball14 left)
   goals met: 29 of 34
77. (pick ball13 rooma right)
   deleted: (at ball13 rooma) (free right)
   added: (carry ball13 right)
   goals met: 29 of 34
78. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 29 of 34
79. (drop ball13 roomb right)
   deleted: (carry ball13 right)
   added: (at ball13 roomb) (free right)
   goals met: 30 of 34
80. (drop ball14 roomb left)
   deleted: (carry ball14 left)
   added: (at ball14 roomb) (free left)
   goals met: 31 of 34
81. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 31 of 34
82. (pick ball12 rooma left)
   deleted: (at ball12 rooma) (free left)
   added: (carry ball12 left)
   goals met: 31 of 34
83. (pick ball11 rooma right)
   deleted: (at ball11 rooma) (free right)
   added: (carry ball11 right)
   goals met: 31 of 34
84. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 31 of 34
85. (drop ball11 roomb right)
   deleted: (carry ball11 right)
   added: (at ball11 roomb) (free right)
   goals met: 32 of 34
86. (drop ball12 roomb left)
   deleted: (carry ball12 left)
   added: (at ball12 roomb) (free left)
   goals met: 33 of 34
87. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 33 of 34
88. (pick ball10 rooma left)
   deleted: (at ball10 rooma) (free left)
   added: (carry ball10 left)
   goals met: 33 of 34
89. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 33 of 34
90. (drop ball10 roomb left)
   deleted: (carry ball10 left)
   added: (at ball10 roomb) (free left)
   goals met: 34 of 34
